[
    {
        "dates": "June 2023 – Present",
        "title": "Senior Software Engineer",
        "business": "Tempus AI",
        "website": "https://www.tempus.com/",
        "bullets": ["Developed a new feature for our laboratory information managements system using C#, Javascript, and SQL that enabled lab techs to enter data while fractionating and extracting biological samples, eliminating the need to track and report on data using manual spreadsheets.",
                    "Built a dynamic reporting platform using SQL that allows lab techs to run and export multiple reports, using future-oriented design principles to ensure new reports could be added as the lab offers more services.",
                    "Reviewed code written by my team, providing feedback on consistently producing efficient and scalable code."
                    ],
        "stack": "C# | .NET | SQL | Typescript | Azure"
    },
    {
        "dates": "March 2020 – May 2023",
        "title": "Software Developer I & II",
        "business": "Rightpoint",
        "website": "https://www.rightpoint.com/",
        "bullets": ["Coordinated design, project management, and development team resources to scale development capacity for a larger project, tightening the timeline between when a feature is designed and when it is released.",
                    "Architected customizable, reusable Sitecore components using C# with a headless React.js front end to organize product information for customers, streamlining both user’s experience browsing the site and the administrator’s experience managing large amounts of content.",
                    "Integrated a GraphQL API to query CMS site data and seamlessly display it on the front end, automating component data retrieval to make components self updating.",
                    "Built a Microsoft Edge add-on using Javascript to make Sitecore more accessible to non-visual users by enhancing Sitecore's screen reader and keyboard navigation support."
                    ],
        "stack": "C# | .NET | SQL | React.js | Sitecore | Azure | CMS"
    },
    {
        "dates": "September 2018 – March 2020",
        "title": "Associate Software Engineer",
        "business": "bSwift",
        "website": "https://www.bswift.com/",
        "bullets": ["Designed a new site feature using Angular that allows clients to build and assign different site themes to different users to provide a tailored enrollment experience.",
                    "Enhanced the ACA reporting process to provide efficient and accurate user information and reduce the need for manual calculation of 1095-C codes."
                    ],
        "stack": "C# | .NET | SQL | Anglar"
        }
]